Revit 2024 API
LinePattern Members
The LinePattern type exposes the following members.
Constructors
Name | Description
LinePattern()
 Creates a simple line pattern.
LinePattern(String)
 Creates a line pattern with given name.
Methods
Name | Description
Dispose
Releases all resources used by the LinePattern
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetSegments
 Gets the sequence of segments that defines this line pattern.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetSegments
 Sets the sequence of segments that defines this line pattern.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Name
 Line pattern name.
See Also
LinePattern Class
Autodesk.Revit.DB Namespace